Catalogs/фин_МоделиПрогнозирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_МоделиПрогнозирования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидМоделиПрогнозирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыМоделейПрогнозирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНаблюдаемыхПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПрогнозируемыхПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСбораНаблюдаемыхДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_СпособыСбораНаблюдаемыхДанныхДляМоделейПрогнозирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПрогнозныхДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийНаблюдаемыхДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпределенияСценарияНаблюдаемыхДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ПорядокОпределенияСценарияНаблюдаемыхДанныхПрогноза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоНаблюдаемогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеНаблюдаемогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаПреобразованияНаблюдаемыхЗначений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаПреобразованияПрогнозируемыхЗначений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозируемыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозируемыйРесурсПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_РесурсыДанныхБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированныеОценкиПараметров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяОценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>18</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаблюдаемыеИсходныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
								<v8:Type>cfg:CatalogRef.фин_РасчетныеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лаг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаПреобразования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаПараметра</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>30</v8:Digits>
									<v8:FractionDigits>18</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрогнозныеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прогноз</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаблюдаемыеЗначенияПрогнозируемогоПоказателя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаблюдаемыеЗначенияИсходныхПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
								<v8:Type>cfg:CatalogRef.фин_РасчетныеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбластьДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрогнозируемыеЗначенияИсходныхПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
								<v8:Type>cfg:CatalogRef.фин_РасчетныеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/фин_ВидыМоделейПрогнозирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыМоделейПрогнозирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЛинейнаяМодельМножественнойРегрессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НелинейнаяМодельМножественнойРегрессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегрессионнаяМодельВременногоРяда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодельПрогнозированияВременногоРядаНаОсновеЭкспоненциальногоСглаживания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_СпособыСбораНаблюдаемыхДанныхДляМоделейПрогнозирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_СпособыСбораНаблюдаемыхДанныхДляМоделейПрогнозирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначенияЗаданногоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначенияПериодаПредшествующегоПрогнозируемому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_ПорядокОпределенияСценарияНаблюдаемыхДанныхПрогноза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ПорядокОпределенияСценарияНаблюдаемыхДанныхПрогноза</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрогнозируемыйСценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбранныйСценарий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/фин_МоделиПрогнозирования/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фин_РаботаСДополнительнымиРазрезамиБюджетирования.ЗаполнитьСписокРазрезовУчета(СписокРазрезов);
	фин_РаботаСДополнительнымиРазрезамиБюджетирования.НастроитьПредставлениеРазрезов(ЭтотОбъект);
	Реквизиты = ПолучитьРеквизиты();
	Для Каждого Реквизит Из Реквизиты  Цикл
		Если Найти(Реквизит.Имя,"Надпись")<>0 Тогда
			ЭтотОбъект[Реквизит.Имя] = Реквизит.Заголовок;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	ЭтоНелинейнаяМодель = Объект.ВидМоделиПрогнозирования=ПредопределенноеЗначение("Перечисление.фин_ВидыМоделейПрогнозирования.НелинейнаяМодельМножественнойРегрессии");
	ЭтоЛинейнаяМодель = Объект.ВидМоделиПрогнозирования=ПредопределенноеЗначение("Перечисление.фин_ВидыМоделейПрогнозирования.ЛинейнаяМодельМножественнойРегрессии");
	Элементы.НачалоНаблюдаемогоПериода.ТолькоПросмотр = Объект.СпособСбораНаблюдаемыхДанных=ПредопределенноеЗначение("Перечисление.фин_СпособыСбораНаблюдаемыхДанныхДляМоделейПрогнозирования.ЗначенияПериодаПредшествующегоПрогнозируемому");
	Элементы.НачалоНаблюдаемогоПериода.Видимость = Объект.СпособСбораНаблюдаемыхДанных=ПредопределенноеЗначение("Перечисление.фин_СпособыСбораНаблюдаемыхДанныхДляМоделейПрогнозирования.ЗначенияЗаданногоПериода");
	Элементы.ОкончаниеНаблюдаемогоПериода.Видимость = Объект.СпособСбораНаблюдаемыхДанных=ПредопределенноеЗначение("Перечисление.фин_СпособыСбораНаблюдаемыхДанныхДляМоделейПрогнозирования.ЗначенияЗаданногоПериода");
	Элементы.ФормулаПреобразованияНаблюдаемыхЗначений.Видимость 			=  ЭтоНелинейнаяМодель; 
	Элементы.ФормулаПреобразованияПрогнозируемыхЗначений.Видимость			=  ЭтоНелинейнаяМодель; 
	Элементы.НаблюдаемыеИсходныеПоказателиФормулаПреобразования.Видимость	=  ЭтоНелинейнаяМодель;
	Элементы.НаблюдаемыеИсходныеПоказатели.Видимость = ЭтоНелинейнаяМодель ИЛИ ЭтоЛинейнаяМодель;
	Элементы.НадписьИсходныеПоказатели.Видимость = ЭтоНелинейнаяМодель ИЛИ ЭтоЛинейнаяМодель;
	Элементы.ФиксированныеОценкиМНК.Видимость = ЭтоНелинейнаяМодель ИЛИ ЭтоЛинейнаяМодель;
	Элементы.ГруппаНаблюдаемыеДанные.Видимость = ?(ЭтоНелинейнаяМодель ИЛИ ЭтоЛинейнаяМодель,НЕ Объект.ФиксированныеОценкиПараметров,Истина);
	Элементы.НаблюдаемыеИсходныеПоказателиОценкаМНК.Видимость = Объект.ФиксированныеОценкиПараметров;
	Элементы.БазоваяОценка.Видимость = ?(ЭтоНелинейнаяМодель ИЛИ ЭтоЛинейнаяМодель,Объект.ФиксированныеОценкиПараметров,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВидМоделиПрогнозированияПриИзменении(Элемент)
	Если Объект.ВидМоделиПрогнозирования=ПредопределенноеЗначение("Перечисление.фин_ВидыМоделейПрогнозирования.МодельПрогнозированияВременногоРядаНаОсновеЭкспоненциальногоСглаживания") ИЛИ Объект.ВидМоделиПрогнозирования=ПредопределенноеЗначение("Перечисление.фин_ВидыМоделейПрогнозирования.РегрессионнаяМодельВременногоРяда") Тогда
		Объект.НаблюдаемыеИсходныеПоказатели.Очистить();
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПрогнозируемыйПоказательПриИзменении(Элемент)
	Объект.ОбластьДействия.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоНаблюдаемыхПериодовПриИзменении(Элемент)
	НастройкаПериодов();
КонецПроцедуры

&НаКлиенте
Процедура СценарийНаблюдаемыхДанныхПриИзменении(Элемент)
	НастройкаПериодов();
КонецПроцедуры

&НаКлиенте
Процедура СценарийПрогнозныхДанныхПриИзменении(Элемент)
	НастройкаПериодов();
КонецПроцедуры

&НаСервере
Процедура НастройкаПериодов()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.НастроитьПериодыПрогноза();	
	ЗначениеВРеквизитФормы(ОбъектОбработки,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура СпособСбораНаблюдаемыхДанныхПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ФормулаПреобразованияНаблюдаемыхЗначенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборФормулы(Объект.ФормулаПреобразованияНаблюдаемыхЗначений,,"ФормулаПреобразованияНаблюдаемыхЗначений");
КонецПроцедуры

&НаКлиенте
Функция ОбработатьВыборФормулы(Текст,ТекущиеДанные=Неопределено,ИмяПоля = "")
	ОписаниеОбработчикЗавершенияВводаФормулы = Новый ОписаниеОповещения("ОбработчикЗавершенияВводаФормулы",ЭтотОбъект,?(ТекущиеДанные=Неопределено,Новый Структура("ИмяПоля",ИмяПоля),Новый Структура("ТекущиеДанные",ТекущиеДанные)));
 	ОткрытьФорму("Обработка.фин_РасчетПоМоделиПрогнозирования.Форма.ФормаФормулы",Новый Структура("Формула",Текст),ЭтотОбъект,,,,ОписаниеОбработчикЗавершенияВводаФормулы,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецФункции

&НаКлиенте
Процедура ОбработчикЗавершенияВводаФормулы(Результат,ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Если ДополнительныеПараметры.Свойство("ТекущиеДанные") Тогда
			ДополнительныеПараметры.ТекущиеДанные.ФормулаПреобразования = Результат;
		Иначе
			Объект[ДополнительныеПараметры.ИмяПоля] = Результат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФормулаПреобразованияПрогнозируемыхЗначенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборФормулы(Объект.ФормулаПреобразованияПрогнозируемыхЗначений,,"ФормулаПреобразованияПрогнозируемыхЗначений");
КонецПроцедуры

&НаКлиенте
Процедура НаблюдаемыеИсходныеПоказателиФормулаПреобразованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборФормулы(Элементы.НаблюдаемыеИсходныеПоказатели.ТекущиеДанные.ФормулаПреобразования,Элементы.НаблюдаемыеИсходныеПоказатели.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОбластьДействияИзмерениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокРазрезов;
КонецПроцедуры

&НаКлиенте
Процедура ОбластьДействияИзмерениеПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ОбластьДействия.ТекущаяСтрока;
	ОбработатьИзменениеРазрезаУчета(ТекущиеДанные);
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеРазрезаУчета(ТекущаяСтрока)
	ТекущиеДанные = Объект.ОбластьДействия.НайтиПоИдентификатору(ТекущаяСтрока);
	ТекущиеДанные.Разрез = фин_РаботаСДополнительнымиРазрезамиБюджетирования.РазрезПоИзмерению(ТекущиеДанные.Измерение);
	Если ЗначениеЗаполнено(ТекущиеДанные.Разрез) Тогда
		ТекущиеДанные.ОсновноеЗначение = ТекущиеДанные.Разрез.ТипЗначения.ПривестиЗначение(ТекущиеДанные.ОсновноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбластьДействияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элемент.ОграничениеТипа = Элементы.ОбластьДействия.ТекущиеДанные.Разрез.ТипЗначения;
КонецПроцедуры

&НаКлиенте
Процедура НачалоНаблюдаемогоПериодаПриИзменении(Элемент)
	НастройкаПериодов();
КонецПроцедуры

&НаКлиенте
Процедура НачалоНаблюдаемогоПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СценарийНаблюдаемый = ?(Объект.ПорядокОпределенияСценарияНаблюдаемыхДанных=ПредопределенноеЗначение("Перечисление.фин_ПорядокОпределенияСценарияНаблюдаемыхДанныхПрогноза.ВыбранныйСценарий") И ЗначениеЗаполнено(Объект.СценарийНаблюдаемыхДанных),Объект.СценарийНаблюдаемыхДанных,Объект.СценарийПрогнозныхДанных);
	Если ЗначениеЗаполнено(СценарийНаблюдаемый) Тогда
		СтандартнаяОбработка = Ложь;
		ОбработатьРегулированиеПериода(СценарийНаблюдаемый,Направление);
	КонецЕсли;
	НастройкаПериодов();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРегулированиеПериода(СценарийНаблюдаемый,Направление)
	Объект.НачалоНаблюдаемогоПериода = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДобавитьИнтервал(Объект.НачалоНаблюдаемогоПериода,СценарийНаблюдаемый,Направление);
КонецПроцедуры

&НаКлиенте
Процедура ФиксированныеОценкиМНКПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
